fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>EnumRef.ВКМ_Сценарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		РассчитатьДлительностьОтпускаНаСервере(Строка.Сотрудник);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	РассчитатьДлительностьОтпускаНаСервере(ТекущиеДанные.Сотрудник);

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	РассчитатьДлительностьОтпускаНаСервере(ТекущиеДанные.Сотрудник);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьДиаграммуГанта(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресТаблицыДанных", СохранитьДанныеВТаблицу());
	ПараметрыФормы.Вставить("Год", Объект.Год);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Номер", Объект.Номер);
	ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
	ПараметрыФормы.Вставить("ЗаголовокФормы", Строка(Объект.Ссылка));
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы,,,,);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьДанныеВТаблицу()
	
	ТаблицаДанных = Объект.ОтпускаСотрудников.Выгрузить();
	АдресТаблицыДанных = ПоместитьВоВременноеХранилище(ТаблицаДанных, УникальныйИдентификатор);
	Возврат АдресТаблицыДанных;
	
КонецФункции

&НаСервере
Процедура РассчитатьДлительностьОтпускаНаСервере(Сотрудник)

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сотрудник", Сотрудник);
	ОтпускаСотрудниковСгруппированные = Объект.ОтпускаСотрудников.Выгрузить( ПараметрыОтбора,
		"Сотрудник, ДатаОкончания, ДатаНачала");

	ДлительностьОтпуска = 0;
	Для Каждого Строка Из ОтпускаСотрудниковСгруппированные Цикл
		ДлительностьОтпуска = ДлительностьОтпуска + (Строка.ДатаОкончания - Строка.ДатаНачала) / (60 * 60 * 24) + 1;
	КонецЦикла;

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Сотрудник = Сотрудник Тогда
			Строка.ДлительностьОтпуска = ДлительностьОтпуска;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
